## plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray
Acquiring state lock. This may take a few moments...
random_id.this: Refreshing state... [id=_Q]
data.http.my_public_ip: Reading...
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-backup-configuration-password-R8Trkh]
aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-console-password-fHbLZ3]
data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.trust_relationship: Reading...
aws_secretsmanager_secret.central_password[0]: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-central-password-kVsZSH]
aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-secure-storage-master-key-bFSUI3]
data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
random_shuffle.az: Refreshing state... [id=-]
data.aws_iam_policy_document.secure_storage_master_key: Reading...
data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=712272081]
aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-secure-storage-master-key-bFSUI3|A046CBE6-C20C-421C-BEBA-49AE145611F3]
aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-backup-configuration-password-R8Trkh|49E0A976-5666-4080-B1E9-088BBF822FB3]
aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-console-password-fHbLZ3|72CD0DAD-1B33-4F9A-A376-669425EF4368]
data.aws_iam_policy_document.ec2_iam_policy: Reading...
data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=4132692670]
data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
aws_vpc.this[0]: Refreshing state... [id=vpc-051130e4758cbefc6]
aws_iam_role.this: Refreshing state... [id=ec2-iam-role-sophos-xgfd-447552758530]
aws_route_table.private[0]: Refreshing state... [id=rtb-0825c4c2745482a5f]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0cb1e4146bd120fa9]
aws_security_group.lan[0]: Refreshing state... [id=sg-0a07af2652b79d94c]
aws_subnet.public[0]: Refreshing state... [id=subnet-04d9868d752d0404e]
aws_route_table.public[0]: Refreshing state... [id=rtb-0eaec8617334c504d]
aws_subnet.private[0]: Refreshing state... [id=subnet-0a2367b0f15dd447c]
aws_security_group.trusted[0]: Refreshing state... [id=sg-017957814a9f4d0d3]
aws_security_group.public[0]: Refreshing state... [id=sg-0af8b40fe3edede8d]
aws_route.public: Refreshing state... [id=r-rtb-0eaec8617334c504d1080289494]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-001bbe242d194374d]
aws_network_interface.private: Refreshing state... [id=eni-000c533f94ba93bb3]
aws_network_interface.public: Refreshing state... [id=eni-055bdd985b7153c14]
aws_route.private: Refreshing state... [id=r-rtb-0825c4c2745482a5f1080289494]
aws_route_table_association.private: Refreshing state... [id=rtbassoc-0705bd1783e57a22b]
aws_iam_role_policy.register_in_central[0]: Refreshing state... [id=ec2-iam-role-sophos-xgfd-447552758530:ec2-central-policy-sophos-xgfd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy

Terraform will perform the following actions:

  # aws_iam_instance_profile.this will be created
+   resource "aws_iam_instance_profile" "this" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "ec2-instance-profile-sophos-xgfd"
+       path        = "/"
+       role        = "ec2-iam-role-sophos-xgfd-447552758530"
+       tags_all    = (known after apply)
+       unique_id   = (known after apply)
    }

  # aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "ec2-iam-role-sophos-xgfd-447552758530"
        name                  = "ec2-iam-role-sophos-xgfd-447552758530"
        tags                  = {}
        # (9 unchanged attributes hidden)

-       inline_policy {
-           name   = "ec2-central-policy-sophos-xgfd" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "secretsmanager:GetSecretValue",
-                               "secretsmanager:DescribeSecret",
                            ]
-                           Effect   = "Allow"
-                           Resource = "arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-central-password-kVsZSH"
-                           Sid      = ""
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_iam_role_policy.register_in_central[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "aws_iam_role_policy" "register_in_central" {
-       id     = "ec2-iam-role-sophos-xgfd-447552758530:ec2-central-policy-sophos-xgfd" -> null
-       name   = "ec2-central-policy-sophos-xgfd" -> null
-       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "secretsmanager:GetSecretValue",
-                           "secretsmanager:DescribeSecret",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-central-password-kVsZSH"
-                       Sid      = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       role   = "ec2-iam-role-sophos-xgfd-447552758530" -> null
    }

  # aws_secretsmanager_secret.central_password[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "aws_secretsmanager_secret" "central_password" {
-       arn                            = "arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-central-password-kVsZSH" -> null
-       force_overwrite_replica_secret = false -> null
-       id                             = "arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-central-password-kVsZSH" -> null
-       name                           = "sophos-central-password" -> null
-       recovery_window_in_days        = 0 -> null
-       rotation_enabled               = false -> null
-       tags                           = {} -> null
-       tags_all                       = {} -> null
    }

  # aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-017957814a9f4d0d3"
      ~ ingress                = [
+           {
+               cidr_blocks      = [
+                   "20.228.80.238/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
-           {
-               cidr_blocks      = [
-                   "20.7.147.255/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
        tags                   = {
            "Name" = "Trusted Network"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"     
```